# Revision Notes

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
os.chdir(r"C:\Users\willi\OneDrive\Documents\Woolf Institute Data Analytics\Live Class Data Sets")

In [4]:
Sal_data = pd.read_csv("basic_salary.csv")
print("âœ… Dataset Loaded Successfully")

âœ… Dataset Loaded Successfully

In [7]:
Sal_data.head(5)

  First_Name Last_Name Grade Location     ba       ms
0       Alan     Brown   GR1    DELHI  17990  16070.0
1     Agatha  Williams   GR2   MUMBAI  12390   6630.0
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3      Ameet    Mishra   GR2    DELHI  14780   9300.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0

In [5]:
Sal_data.loc[2]

First_Name     Rajesh
Last_Name       Kolte
Grade             GR1
Location       MUMBAI
ba              19250
ms            14960.0
Name: 2, dtype: object

In [11]:
Sal_data.loc[2:4]

  First_Name Last_Name Grade Location     ba       ms
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3      Ameet    Mishra   GR2    DELHI  14780   9300.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0

In [10]:
Sal_data.iloc[2]

First_Name     Rajesh
Last_Name       Kolte
Grade             GR1
Location       MUMBAI
ba              19250
ms            14960.0
Name: 2, dtype: object

In [12]:
Sal_data.iloc[2:4]

  First_Name Last_Name Grade Location     ba       ms
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3      Ameet    Mishra   GR2    DELHI  14780   9300.0

In [16]:
Sal_data.loc[2:4, ["First_Name", "Grade","ba"]] # 2nd to 4th row, Salary column

  First_Name Grade     ba
2     Rajesh   GR1  19250
3      Ameet   GR2  14780
4       Neha   GR1  19235

Two Ways to Filter Data in Pandas

In [29]:
# The query() method allows filtering using SQL-like syntax.

# ðŸ”¹ Example: Select employees with a Basic Salary greater than 50000

Filtered = Sal_data.query("ba > 10000 & Location == 'MUMBAI'")
print("Employees in Delhi with Basic Salary greater than 10000:\n")
print(Filtered)

Employees in Delhi with Basic Salary greater than 10000:

   First_Name Last_Name Grade Location     ba       ms
1      Agatha  Williams   GR2   MUMBAI  12390   6630.0
2      Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
4        Neha       Rao   GR1   MUMBAI  19235  15200.0
5       Sagar    Chavan   GR2   MUMBAI  13390   6700.0
6       Aaron     Jones   GR1   MUMBAI  23280  13490.0
7        John     Patil   GR2   MUMBAI  13500  10760.0
11       Anup      Save   GR2   MUMBAI  11960   7880.0

In [28]:
Filtered2 = Sal_data.query("Location == 'DELHI' & Grade! = 'GR2'")
print("Filtered Employees:\n")
print(Filtered2)

Filtered Employees:

  First_Name Last_Name Grade Location     ba       ms
0       Alan     Brown   GR1    DELHI  17990  16070.0
8      Sneha     Joshi   GR1    DELHI  20660      NaN

In [27]:
# Group by 'Grade' and sum the 'ba' column
salary_by_grade = Sal_data.groupby("Grade")["ba"].sum()

print("Total Basic Salary by Grade:\n")
print(salary_by_grade)

Total Basic Salary by Grade:

Grade
GR1    100415
GR2     93440
Name: ba, dtype: int64